data/Log/Simultaneous/app_perf/setup2/mongo_load.out
java -cp /home/ubuntu/ycsb/mongodb-binding/conf:/home/ubuntu/ycsb/conf:/home/ubuntu/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/ycsb/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/ycsb/lib/core-0.12.0.jar:/home/ubuntu/ycsb/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/ycsb/mongodb-binding/lib/mongo-java-driver-3.0.3.jar:/home/ubuntu/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/home/ubuntu/ycsb/mongodb-binding/lib/mongodb-binding-0.12.0.jar:/home/ubuntu/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/home/ubuntu/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/home/ubuntu/ycsb/mongodb-binding/lib/slf4j-api-1.6.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P /home/ubuntu/ycsb/workloads/workload1 -p mongodb.url=mongodb://10.0.3.220:27017/ycsb?w=0 -p maxexecutiontime=600 -t
YCSB Client 0.12.0
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P /home/ubuntu/ycsb/workloads/workload1 -p mongodb.url=mongodb://10.0.3.220:27017/ycsb?w=0 -p maxexecutiontime=600 -t
Loading workload...
Starting test.
Maximum execution time specified as: 600 secs
2017-06-24 20:33:24:720 0 sec: 0 operations; est completion in 0 seconds 
mongo client connection created with mongodb://10.0.3.220:27017/ycsb?w=0
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2017-06-24 20:33:34:575 10 sec: 477 operations; 47.7 current ops/sec; est completion in 2 days 10 hours [READ: Count=477, Max=139007, Min=3458, Avg=18556.42, 90=29695, 99=48639, 99.9=139007, 99.99=139007] 
2017-06-24 20:33:44:575 20 sec: 1155 operations; 67.8 current ops/sec; est completion in 2 days [READ: Count=678, Max=108287, Min=288, Avg=14705.36, 90=23935, 99=39455, 99.9=67711, 99.99=108287] 
2017-06-24 20:33:54:575 30 sec: 2001 operations; 84.6 current ops/sec; est completion in 1 days 17 hours [READ: Count=846, Max=297471, Min=218, Avg=11780.97, 90=18015, 99=29839, 99.9=51167, 99.99=297471] 
2017-06-24 20:34:04:575 40 sec: 2888 operations; 88.7 current ops/sec; est completion in 1 days 14 hours [READ: Count=887, Max=82431, Min=189, Avg=11198.09, 90=16271, 99=35039, 99.9=70847, 99.99=82431] 
2017-06-24 20:34:14:575 50 sec: 3871 operations; 98.3 current ops/sec; est completion in 1 days 11 hours [READ: Count=983, Max=39551, Min=182, Avg=10150.64, 90=15543, 99=24239, 99.9=38463, 99.99=39551] 
2017-06-24 20:34:24:575 60 sec: 4777 operations; 90.6 current ops/sec; est completion in 1 days 10 hours [READ: Count=906, Max=199167, Min=183, Avg=11020.78, 90=16247, 99=34847, 99.9=61087, 99.99=199167] 
2017-06-24 20:34:34:575 70 sec: 5762 operations; 98.5 current ops/sec; est completion in 1 days 9 hours [READ: Count=985, Max=63807, Min=190, Avg=10133.43, 90=15647, 99=28159, 99.9=40191, 99.99=63807] 
2017-06-24 20:34:44:575 80 sec: 6828 operations; 106.6 current ops/sec; est completion in 1 days 8 hours [READ: Count=1066, Max=63615, Min=168, Avg=9372.98, 90=15111, 99=19871, 99.9=60543, 99.99=63615] 
2017-06-24 20:34:54:575 90 sec: 7889 operations; 106.1 current ops/sec; est completion in 1 days 7 hours [READ: Count=1061, Max=54591, Min=147, Avg=9412.94, 90=15127, 99=18687, 99.9=48895, 99.99=54591] 
2017-06-24 20:35:04:575 100 sec: 8959 operations; 107 current ops/sec; est completion in 1 days 6 hours [READ: Count=1070, Max=136447, Min=146, Avg=9335.14, 90=15319, 99=16959, 99.9=55391, 99.99=136447] 
2017-06-24 20:35:14:575 110 sec: 10042 operations; 108.3 current ops/sec; est completion in 1 days 6 hours [READ: Count=1083, Max=82559, Min=148, Avg=9195.79, 90=15247, 99=17039, 99.9=43167, 99.99=82559] 
2017-06-24 20:35:24:575 120 sec: 11134 operations; 109.2 current ops/sec; est completion in 1 days 5 hours [READ: Count=1092, Max=67071, Min=142, Avg=9147.72, 90=15247, 99=25503, 99.9=41695, 99.99=67071] 
2017-06-24 20:35:34:575 130 sec: 12272 operations; 113.8 current ops/sec; est completion in 1 days 5 hours [READ: Count=1138, Max=165631, Min=145, Avg=8774.33, 90=14823, 99=16879, 99.9=63263, 99.99=165631] 
2017-06-24 20:35:44:575 140 sec: 13394 operations; 112.2 current ops/sec; est completion in 1 days 4 hours [READ: Count=1122, Max=31887, Min=148, Avg=8885.46, 90=15007, 99=17359, 99.9=28143, 99.99=31887] 
2017-06-24 20:35:54:575 150 sec: 14561 operations; 116.7 current ops/sec; est completion in 1 days 4 hours [READ: Count=1167, Max=52383, Min=149, Avg=8575.5, 90=15079, 99=16783, 99.9=51167, 99.99=52383] 
2017-06-24 20:36:04:575 160 sec: 15728 operations; 116.7 current ops/sec; est completion in 1 days 4 hours [READ: Count=1167, Max=59775, Min=144, Avg=8557.69, 90=15119, 99=18943, 99.9=40927, 99.99=59775] 
2017-06-24 20:36:14:575 170 sec: 16925 operations; 119.7 current ops/sec; est completion in 1 days 3 hours [READ: Count=1197, Max=67135, Min=147, Avg=8350.14, 90=14759, 99=18143, 99.9=37663, 99.99=67135] 
2017-06-24 20:36:24:575 180 sec: 18071 operations; 114.6 current ops/sec; est completion in 1 days 3 hours [READ: Count=1146, Max=115327, Min=144, Avg=8726.32, 90=15343, 99=19855, 99.9=42367, 99.99=115327] 
2017-06-24 20:36:34:575 190 sec: 19306 operations; 123.5 current ops/sec; est completion in 1 days 3 hours [READ: Count=1235, Max=44927, Min=140, Avg=8090.71, 90=15007, 99=17119, 99.9=44799, 99.99=44927] 
2017-06-24 20:36:44:575 200 sec: 20528 operations; 122.2 current ops/sec; est completion in 1 days 3 hours [READ: Count=1222, Max=46239, Min=161, Avg=8171.66, 90=14767, 99=17471, 99.9=41119, 99.99=46239] 
2017-06-24 20:36:54:575 210 sec: 21807 operations; 127.9 current ops/sec; est completion in 1 days 2 hours [READ: Count=1279, Max=124159, Min=163, Avg=7819.46, 90=14695, 99=17023, 99.9=40863, 99.99=124159] 
2017-06-24 20:37:04:575 220 sec: 23065 operations; 125.8 current ops/sec; est completion in 1 days 2 hours [READ: Count=1258, Max=56543, Min=163, Avg=7935.52, 90=14887, 99=20255, 99.9=53151, 99.99=56543] 
2017-06-24 20:37:14:575 230 sec: 24355 operations; 129 current ops/sec; est completion in 1 days 2 hours [READ: Count=1290, Max=40927, Min=160, Avg=7755.13, 90=14807, 99=17135, 99.9=38303, 99.99=40927] 
2017-06-24 20:37:24:575 240 sec: 25649 operations; 129.4 current ops/sec; est completion in 1 days 1 hours [READ: Count=1294, Max=71295, Min=162, Avg=7721.31, 90=15111, 99=18287, 99.9=65183, 99.99=71295] 
2017-06-24 20:37:34:575 250 sec: 26979 operations; 133 current ops/sec; est completion in 1 days 1 hours [READ: Count=1330, Max=125119, Min=163, Avg=7514.59, 90=14511, 99=17503, 99.9=46815, 99.99=125119] 
2017-06-24 20:37:44:575 260 sec: 28327 operations; 134.8 current ops/sec; est completion in 1 days 1 hours [READ: Count=1348, Max=42623, Min=162, Avg=7417, 90=15111, 99=19519, 99.9=36735, 99.99=42623] 
2017-06-24 20:37:54:575 270 sec: 29727 operations; 140 current ops/sec; est completion in 1 days 1 hours [READ: Count=1400, Max=43743, Min=164, Avg=7135.51, 90=14871, 99=17487, 99.9=43583, 99.99=43743] 
2017-06-24 20:38:04:575 280 sec: 30894 operations; 116.7 current ops/sec; est completion in 1 days 1 hours [READ: Count=1167, Max=101311, Min=165, Avg=8563.86, 90=16327, 99=39039, 99.9=83903, 99.99=101311] 
2017-06-24 20:38:14:575 290 sec: 32329 operations; 143.5 current ops/sec; est completion in 1 days [READ: Count=1435, Max=70591, Min=162, Avg=6965.44, 90=14719, 99=17711, 99.9=45279, 99.99=70591] 
2017-06-24 20:38:24:575 300 sec: 33846 operations; 151.7 current ops/sec; est completion in 1 days [READ: Count=1517, Max=46207, Min=159, Avg=6583, 90=14407, 99=19535, 99.9=37727, 99.99=46207] 
2017-06-24 20:38:34:575 310 sec: 35317 operations; 147.1 current ops/sec; est completion in 1 days [READ: Count=1471, Max=38431, Min=165, Avg=6795.71, 90=14887, 99=19231, 99.9=33375, 99.99=38431] 
2017-06-24 20:38:44:575 320 sec: 36822 operations; 150.5 current ops/sec; est completion in 1 days [READ: Count=1505, Max=140287, Min=162, Avg=6635.33, 90=14679, 99=23295, 99.9=68607, 99.99=140287] 
2017-06-24 20:38:54:575 330 sec: 38373 operations; 155.1 current ops/sec; est completion in 23 hours 47 minutes [READ: Count=1551, Max=74751, Min=160, Avg=6444.14, 90=14455, 99=18159, 99.9=35295, 99.99=74751] 
2017-06-24 20:39:04:575 340 sec: 40005 operations; 163.2 current ops/sec; est completion in 23 hours 30 minutes [READ: Count=1632, Max=74687, Min=163, Avg=6124.92, 90=14319, 99=17695, 99.9=39135, 99.99=74687] 
2017-06-24 20:39:14:575 350 sec: 41557 operations; 155.2 current ops/sec; est completion in 23 hours 17 minutes [READ: Count=1552, Max=154367, Min=143, Avg=6436.57, 90=14671, 99=19087, 99.9=34943, 99.99=154367] 
2017-06-24 20:39:24:575 360 sec: 43151 operations; 159.4 current ops/sec; est completion in 23 hours 4 minutes [READ: Count=1594, Max=53151, Min=136, Avg=6267.69, 90=14647, 99=20399, 99.9=36735, 99.99=53151] 
2017-06-24 20:39:34:575 370 sec: 44807 operations; 165.6 current ops/sec; est completion in 22 hours 50 minutes [READ: Count=1656, Max=64383, Min=141, Avg=6038.88, 90=14255, 99=21407, 99.9=33983, 99.99=64383] 
2017-06-24 20:39:44:575 380 sec: 46492 operations; 168.5 current ops/sec; est completion in 22 hours 35 minutes [READ: Count=1685, Max=45727, Min=139, Avg=5927.7, 90=14583, 99=22511, 99.9=35391, 99.99=45727] 
2017-06-24 20:39:54:575 390 sec: 48178 operations; 168.6 current ops/sec; est completion in 22 hours 22 minutes [READ: Count=1686, Max=49567, Min=137, Avg=5926.68, 90=14455, 99=20223, 99.9=32607, 99.99=49567] 
2017-06-24 20:40:04:575 400 sec: 49889 operations; 171.1 current ops/sec; est completion in 22 hours 9 minutes [READ: Count=1711, Max=113215, Min=138, Avg=5840.72, 90=14991, 99=21247, 99.9=61567, 99.99=113215] 
2017-06-24 20:40:14:575 410 sec: 51687 operations; 179.8 current ops/sec; est completion in 21 hours 55 minutes [READ: Count=1798, Max=42815, Min=136, Avg=5556.77, 90=13903, 99=19951, 99.9=34367, 99.99=42815] 
2017-06-24 20:40:24:575 420 sec: 53505 operations; 181.8 current ops/sec; est completion in 21 hours 41 minutes [READ: Count=1818, Max=59295, Min=139, Avg=5497.01, 90=14247, 99=19551, 99.9=39007, 99.99=59295] 
2017-06-24 20:40:34:575 430 sec: 55479 operations; 197.4 current ops/sec; est completion in 21 hours 24 minutes [READ: Count=1974, Max=69695, Min=158, Avg=5058.07, 90=13487, 99=18927, 99.9=33535, 99.99=69695] 
2017-06-24 20:40:44:575 440 sec: 57394 operations; 191.5 current ops/sec; est completion in 21 hours 10 minutes [READ: Count=1915, Max=97599, Min=155, Avg=5217.9, 90=13879, 99=20015, 99.9=41695, 99.99=97599] 
2017-06-24 20:40:54:575 450 sec: 59451 operations; 205.7 current ops/sec; est completion in 20 hours 54 minutes [READ: Count=2057, Max=35039, Min=138, Avg=4859.64, 90=13831, 99=19519, 99.9=32895, 99.99=35039] 
2017-06-24 20:41:04:575 460 sec: 61504 operations; 205.3 current ops/sec; est completion in 20 hours 38 minutes [READ: Count=2053, Max=60095, Min=135, Avg=4861.4, 90=13503, 99=21439, 99.9=33503, 99.99=60095] 
2017-06-24 20:41:14:575 470 sec: 63701 operations; 219.7 current ops/sec; est completion in 20 hours 21 minutes [READ: Count=2197, Max=110783, Min=136, Avg=4548.43, 90=13327, 99=20415, 99.9=31359, 99.99=110783] 
2017-06-24 20:41:24:575 480 sec: 65862 operations; 216.1 current ops/sec; est completion in 20 hours 6 minutes [READ: Count=2161, Max=47583, Min=134, Avg=4627.38, 90=13799, 99=20655, 99.9=40191, 99.99=47583] 
2017-06-24 20:41:34:575 490 sec: 68132 operations; 227 current ops/sec; est completion in 19 hours 50 minutes [READ: Count=2270, Max=81663, Min=137, Avg=4403.99, 90=12903, 99=20031, 99.9=33439, 99.99=81663] 
2017-06-24 20:41:44:575 500 sec: 70470 operations; 233.8 current ops/sec; est completion in 19 hours 34 minutes [READ: Count=2338, Max=71423, Min=137, Avg=4271.91, 90=13199, 99=19391, 99.9=41855, 99.99=71423] 
2017-06-24 20:41:54:575 510 sec: 72917 operations; 244.7 current ops/sec; est completion in 19 hours 17 minutes [READ: Count=2447, Max=49695, Min=136, Avg=4084.28, 90=12975, 99=19679, 99.9=28719, 99.99=49695] 
2017-06-24 20:42:04:575 520 sec: 75363 operations; 244.6 current ops/sec; est completion in 19 hours 1 minutes [READ: Count=2446, Max=75775, Min=135, Avg=4081.63, 90=12831, 99=19295, 99.9=52447, 99.99=75775] 
2017-06-24 20:42:14:575 530 sec: 77973 operations; 261 current ops/sec; est completion in 18 hours 44 minutes [READ: Count=2610, Max=47487, Min=157, Avg=3833.86, 90=12959, 99=19743, 99.9=36959, 99.99=47487] 
2017-06-24 20:42:24:575 540 sec: 80637 operations; 266.4 current ops/sec; est completion in 18 hours 27 minutes [READ: Count=2664, Max=67391, Min=156, Avg=3749.13, 90=12455, 99=17983, 99.9=28399, 99.99=67391] 
2017-06-24 20:42:34:575 550 sec: 83420 operations; 278.3 current ops/sec; est completion in 18 hours 9 minutes [READ: Count=2783, Max=50463, Min=158, Avg=3588.42, 90=12199, 99=18943, 99.9=34399, 99.99=50463] 
2017-06-24 20:42:44:575 560 sec: 86250 operations; 283 current ops/sec; est completion in 17 hours 52 minutes [READ: Count=2830, Max=57215, Min=158, Avg=3534.19, 90=12127, 99=19951, 99.9=40511, 99.99=57215] 
2017-06-24 20:42:54:575 570 sec: 89314 operations; 306.4 current ops/sec; est completion in 17 hours 34 minutes [READ: Count=3064, Max=71743, Min=155, Avg=3261.49, 90=11647, 99=18495, 99.9=30255, 99.99=71743] 
2017-06-24 20:43:04:575 580 sec: 92423 operations; 310.9 current ops/sec; est completion in 17 hours 16 minutes [READ: Count=3109, Max=133887, Min=154, Avg=3211.54, 90=12047, 99=17487, 99.9=38847, 99.99=133887] 
2017-06-24 20:43:14:575 590 sec: 95575 operations; 315.2 current ops/sec; est completion in 16 hours 59 minutes [READ: Count=3152, Max=46271, Min=153, Avg=3170.49, 90=11591, 99=18351, 99.9=28335, 99.99=46271] 
2017-06-24 20:43:24:575 600 sec: 98865 operations; 329 current ops/sec; est completion in 16 hours 41 minutes [READ: Count=3290, Max=37791, Min=155, Avg=3038.19, 90=11823, 99=19295, 99.9=28991, 99.99=37791] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2017-06-24 20:43:24:595 600 sec: 98866 operations; 50 current ops/sec; est completion in 16 hours 41 minutes [READ: Count=1, Max=18655, Min=18640, Avg=18648, 90=18655, 99=18655, 99.9=18655, 99.99=18655] [CLEANUP: Count=1, Max=2004, Min=2004, Avg=2004, 90=2004, 99=2004, 99.9=2004, 99.99=2004] 
[OVERALL], RunTime(ms), 600024.0
[OVERALL], Throughput(ops/sec), 164.77007586363212
[TOTAL_GCS_PS_Scavenge], Count, 88.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 178.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.02966548004746477
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 88.0
[TOTAL_GC_TIME], Time(ms), 178.0
[TOTAL_GC_TIME_%], Time(%), 0.02966548004746477
[READ], Operations, 98866.0
[READ], AverageLatency(us), 6050.9236643537715
[READ], MinLatency(us), 134.0
[READ], MaxLatency(us), 297471.0
[READ], 95thPercentileLatency(us), 16015.0
[READ], 99thPercentileLatency(us), 22607.0
[READ], Return=OK, 98866
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 2004.0
[CLEANUP], MinLatency(us), 2004.0
[CLEANUP], MaxLatency(us), 2004.0
[CLEANUP], 95thPercentileLatency(us), 2004.0
[CLEANUP], 99thPercentileLatency(us), 2004.0